{
  "results": [
    {
      "id": 399579,
      "title": "Alita: Battle Angel",
      "description": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
      "genre": "Action, Science Fiction, Adventure",
      "rating": "PG-13",
      "release": "2019-01-31",
      "duration": "2h 2m",
      "score": "7.2",
      "type": "Movies",
      "poster_path": "/xRWht48C2V8XNfzvPehyClOvDni.jpg"
    },
    {
      "id": 297802,
      "title": "Aquaman",
      "description": "Once home to the most advanced civilization on Earth, Atlantis is now an underwater kingdom ruled by the power-hungry King Orm. With a vast army at his disposal, Orm plans to conquer the remaining oceanic people and then the surface world. Standing in his way is Arthur Curry, Orm's half-human, half-Atlantean brother and true heir to the throne.",
      "genre": "Action ,Adventure ,Fantasy",
      "rating": "PG-13",
      "release": "2018-12-07",
      "duration": "2h 23m",
      "score": "6.9",
      "type": "Movies",
      "poster_path": "/xLPffWMhMj1l50ND3KchMjYoKmE.jpg"
    },
    {
      "id": 424694,
      "title": "Bohemian Rhapsody",
      "description": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
      "genre": "Music, Drama, History",
      "rating": "PG-13",
      "release": "2018-10-24",
      "duration": "2h 15m",
      "score": "8.0",
      "type": "Movies",
      "poster_path": "/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg"
    },
    {
      "id": 438650,
      "title": "Cold Pursuit",
      "description": "The quiet family life of Nels Coxman, a snowplow driver, is upended after his son's murder. Nels begins a vengeful hunt for Viking, the drug lord he holds responsible for the killing, eliminating Viking's associates one by one. As Nels draws closer to Viking, his actions bring even more unexpected and violent consequences, as he proves that revenge is all in the execution.",
      "genre": "Action, Crime, Thriller",
      "rating": "R",
      "release": "2019-02-07",
      "duration": "1h 59m",
      "score": "5.7",
      "type": "Movies",
      "poster_path": "/hXgmWPd1SuujRZ4QnKLzrj79PAw.jpg"
    },
    {
      "id": 527774,
      "title": "Raya and the Last Dragon",
      "description": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when an evil force threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, that same evil has returned and it’s up to a lone warrior, Raya, to track down the legendary last dragon to restore the fractured land and its divided people.",
      "genre": "Animation, Adventure, Fantasy, Family, Action",
      "rating": "R13+",
      "release": "2021-03-03",
      "duration": "1h 47m",
      "score": "8.3",
      "type": "Movies",
      "poster_path": "/lPsD10PP4rgUGiGR4CCXA6iY0QQ.jpg"
    },
    {
      "id": 338952,
      "title": "Fantastic Beasts: The Crimes of Grindelwald",
      "description": "Gellert Grindelwald has escaped imprisonment and has begun gathering followers to his cause—elevating wizards above all non-magical beings. The only one capable of putting a stop to him is the wizard he once called his closest friend, Albus Dumbledore. However, Dumbledore will need to seek help from the wizard who had thwarted Grindelwald once before, his former student Newt Scamander, who agrees to help, unaware of the dangers that lie ahead. Lines are drawn as love and loyalty are tested, even among the truest friends and family, in an increasingly divided wizarding world.",
      "genre": "Adventure, Fantasy, Drama",
      "rating": "PG-13",
      "release": "2018-11-14",
      "duration": "2h 14m",
      "score": "6.9",
      "type": "Movies",
      "poster_path": "/fMMrl8fD9gRCFJvsx0SuFwkEOop.jpg"
    },
    {
      "id": 450465,
      "title": "Glass",
      "description": "In a series of escalating encounters, former security guard David Dunn uses his supernatural abilities to track Kevin Wendell Crumb, a disturbed man who has twenty-four personalities. Meanwhile, the shadowy presence of Elijah Price emerges as an orchestrator who holds secrets critical to both men.",
      "genre": "Thriller, Drama, Science Fiction",
      "rating": "PG-13",
      "release": "2019-01-16",
      "duration": "2h 9m",
      "score": "6.7",
      "type": "Movies",
      "poster_path": "/svIDTNUoajS8dLEo7EosxvyAsgJ.jpg"
    },
    {
      "id": 10191,
      "title": "How to Train Your Dragon",
      "description": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father",
      "genre": "Fantasy, Adventure, Animation, Family",
      "rating": "PG",
      "release": "2010-03-10",
      "duration": "1h 38m",
      "score": "7.8",
      "type": "Movies",
      "poster_path": "/ygGmAO60t8GyqUo9xYeYxSZAR3b.jpg"
    },
    {
      "id": 299536,
      "title": "Avengers: Infinity War",
      "description": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
      "genre": "Adventure, Action, Science Fiction",
      "rating": "PG-13",
      "release": "2018-04-25",
      "duration": "2h 29m",
      "score": "8.3",
      "type": "Movies",
      "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg"
    },
    {
      "id": 82690,
      "title": "Wreck-It Ralph",
      "description": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
      "genre": "Family, Animation, Comedy, Adventure",
      "rating": "PG",
      "release": "2012-01-01",
      "duration": "1h 41m",
      "score": "7.5",
      "type": "Movies",
      "poster_path": "/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg"
    }
  ]
}